---
kind: property
id: P:Autodesk.Revit.DB.PointCloudType.ColorEncoding
source: html/322946b6-a9c1-ea15-ead5-5672be3644ea.htm
---
# Autodesk.Revit.DB.PointCloudType.ColorEncoding Property

The color encoding used by points extracted from instances of this point cloud.

## Syntax (C#)
```csharp
public PointCloudColorEncoding ColorEncoding { get; }
```